#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.resource_group_001: Refreshing state... [id=/subscriptions/f97886f5-6d82-40ed-8ebf-1158b59ed783/resourceGroups/lig-rg]
azurerm_service_plan.service_plan_001: Refreshing state... [id=/subscriptions/f97886f5-6d82-40ed-8ebf-1158b59ed783/resourceGroups/lig-rg/providers/Microsoft.Web/serverfarms/web-app-001-sp-001]
azurerm_windows_web_app.web_app_001: Refreshing state... [id=/subscriptions/f97886f5-6d82-40ed-8ebf-1158b59ed783/resourceGroups/lig-rg/providers/Microsoft.Web/sites/lig-app-uk]
azurerm_windows_web_app_slot.web_app_001_staging: Refreshing state... [id=/subscriptions/f97886f5-6d82-40ed-8ebf-1158b59ed783/resourceGroups/lig-rg/providers/Microsoft.Web/sites/lig-app-uk/slots/Staging]
azurerm_windows_web_app_slot.web_app_001_qa: Refreshing state... [id=/subscriptions/f97886f5-6d82-40ed-8ebf-1158b59ed783/resourceGroups/lig-rg/providers/Microsoft.Web/sites/lig-app-uk/slots/QA]
azurerm_windows_web_app_slot.web_app_001_dev: Refreshing state... [id=/subscriptions/f97886f5-6d82-40ed-8ebf-1158b59ed783/resourceGroups/lig-rg/providers/Microsoft.Web/sites/lig-app-uk/slots/Dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_windows_web_app.web_app_002 will be created
  + resource "azurerm_windows_web_app" "web_app_002" {
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = "lig-app-uk-002"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "lig-rg"
      + service_plan_id                   = "/subscriptions/f97886f5-6d82-40ed-8ebf-1158b59ed783/resourceGroups/lig-rg/providers/Microsoft.Web/serverfarms/web-app-001-sp-001"
      + site_credential                   = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + auth_settings {
          + additional_login_parameters    = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }

      + site_config {
          + always_on                               = true
          + auto_heal_enabled                       = false
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = (known after apply)
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + windows_fx_version                      = (known after apply)
          + worker_count                            = (known after apply)

          + application_stack {
              + current_stack             = (known after apply)
              + docker_container_name     = (known after apply)
              + docker_container_registry = (known after apply)
              + docker_container_tag      = (known after apply)
              + dotnet_version            = (known after apply)
              + java_container            = (known after apply)
              + java_container_version    = (known after apply)
              + java_version              = (known after apply)
              + node_version              = (known after apply)
              + php_version               = (known after apply)
              + python_version            = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @Official-James, Action: `pull_request`, Workflow: `CI/CD`*